<template>
  <div>
    <el-row :gutter="10">
      <el-col :span="12">
        <p class="title-1 mb-5">产品简介</p>
        <p class="title-2 mb-10">仿生蚂蚁机械</p>
        <p class="title-3 mb-5">仿生蚂蚁功能</p>
        <p class="article mb-5">
          <b>1.体积小。</b>仿生蚂蚁最大步长为 42cm，正常行走时最大直径为 35cm，该长度小于
          成年人的肩宽，因此能进入成人无法进入的深洞或缝隙。
        </p>
        <p class="article mb-5">
          <b>2.生命检测。</b>仿生蚂蚁配备的深度相机具有活体检测功能，可以监测生物的生命体
          征与动作，监测生物体温精确度可以达到 0.1 摄氏度。
        </p>
        <p class="article mb-5">
          <b>3.两种运动方式。</b>实行监测任务时，六足同时运动，速度更快，穿越复杂地形的能
          力更强。当协同搬运时，前 1、2 足可实行夹取，此时后四足行走。
        </p>
        <p class="article mb-5">
          <b>4.创建勘探地形。</b>应用 Slam 技术，能够在黑暗环境中对勘测地形进行三维重建，
          并可以将实时信息传递给控制中心，为救援的人员调动节省资源。
        </p>
        <p class="article mb-5">
          <b>5.模块化设计。</b>仿生机械各个部分相互独立，协同工作。分为机械本体、视觉模块、
          动力模块、控制模块、末端执行器等。任意模块出现问题都可独立取下更换，也可以根
          据需求更换不同的模块。
        </p>
        <p class="article mb-10">
          <b>6.多情况自主巡航。</b>仿生蚂蚁具有搜救功能，灾难发生后，地表会出现各种情况的
          破坏，地形的复杂程度也是不可预料的。所以为了适应复杂地形，机械配备了多种巡航
          算法。同时可以将最优路线传递给其他的机械和救援人员。
        </p>
        <p class="title-3 mb-5">仿生蚂蚁本体设计</p>
        <p class="article mb-10">仿生蚂蚁是一个复杂的并联机构，机械本体有六条腿，每条腿有多个自由度。先将
          仿生蚂蚁的每条腿独立成为一个多关节的串联机械臂，最终将六个串联的机械臂整合为
          一个并联系统。</p>
        <p class="article mb-10">仿生蚂蚁机械仿生于“六足纲”昆虫的身体结构。“六足纲”昆虫（比如蚂蚁、蟑
          螂等）的身体结构方面，六足对称均匀分布，且每条腿有四个关节，这四个关节分别为
          根关节、髋关节、膝关节、腂管关节。在这四个关节中，前三个关节为驱动关节，主要
          负责本体的运动，各个关节之间得到连杆分别称为基节、骨节、胫节、足。因此本设计
          中的仿生蚂蚁六足机械设计为六条腿，每条腿四个自由度。</p>
      </el-col>
      <el-col :span="12">
        <el-image :src="require('../../public/images/仿生蚂蚁机械.png')"/>
      </el-col>
    </el-row>
  </div>
</template>

<script>
export default {
  name: "Home"
}
</script>

<style scoped>
</style>
